Config/DataProcessors/ВыгрузкаВТСД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузкаВТСД</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Config/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/DataProcessors/ВыгрузкаВТСД/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СхемаКомпоновки = РеквизитФормыВЗначение("Объект").ПолучитьМакет("СхемаКомпоновкиДанных");
	АдресСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновки, УникальныйИдентификатор);
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы);
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновки.НастройкиПоУмолчанию);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ТаблицаДанных

&НаКлиенте
Процедура ТаблицаДанныхИнвентарныйНомерПриИзменении(Элемент)
	
	СписокШтрихкодов = ПолучитьДанныеВыбораШтрихкода();
	
	Если СписокШтрихкодов.Количество() = 1 Тогда
		ТекущиеДанные = Элементы.ТаблицаДанных.ТекущиеДанные;
		ТекущиеДанные.Штрихкод = СписокШтрихкодов[0].Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДанныхШтрихкодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаДанных.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("Объект, ИнвентарныйНомер", ТекущиеДанные.ОсновноеСредство, ТекущиеДанные.ИнвентарныйНомер);
	ПараметрыФормы = Новый Структура("Отбор, РежимВыбора", Отбор, Истина);
	ОткрытьФорму("РегистрСведений.Штрихкоды.ФормаСписка", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДанныхШтрихкодОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("РегистрСведенийКлючЗаписи.Штрихкоды") Тогда
		ВыбранноеЗначение = ШтрихкодИзКлючаЗаписи(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДанныхШтрихкодАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ОбработкаПолученияДанныхШтрихкода(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДанныхШтрихкодОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ОбработкаПолученияДанныхШтрихкода(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьТаблицу(Команда)
	
	ЗаполнитьТаблицуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВТСД(Команда)
	
	#Если ВебКлиент Тогда
		ТекстПредупреждения = НСтр("ru = 'Работа с торговым оборудованием не поддерживается в режиме веб-клиента.
			|Для использования терминала сбора данных запустите программу в режиме тонкого клиента.'");
		ПоказатьПредупреждение(, ТекстПредупреждения);
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Объекты не выгружены'"));
		Возврат;
	#КонецЕсли
	
	ТаблицаОСДляТСД = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.Штрихкод) Тогда
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.ИнвентарныйНомер) Тогда
				ПредставлениеОС = СтрШаблон(НСтр("ru = '%1, инв. №:%2'"),
					СокрЛП(СтрокаТаблицы.ОсновноеСредство), СокрЛП(СтрокаТаблицы.ИнвентарныйНомер));
			Иначе
				ПредставлениеОС = СокрЛП(СтрокаТаблицы.ОсновноеСредство);
			КонецЕсли;
			Данные = Новый Структура("Штрихкод, Номенклатура, Цена", СтрокаТаблицы.Штрихкод, ПредставлениеОС, 0);
			
			ТаблицаОСДляТСД.Добавить(Данные);
			
		КонецЕсли;
	КонецЦикла;
	
	Если ТаблицаОСДляТСД.Количество() > 0 Тогда
		УправлениеОсновнымиСредствамиКлиент.ВыгрузитьДанныеВТСД(ЭтотОбъект, ТаблицаОСДляТСД);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Нет объектов для выгрузки'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуНаСервере()
	
	СхемаКомпоновки = РеквизитФормыВЗначение("Объект").ПолучитьМакет("СхемаКомпоновкиДанных");
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновки, Настройки, ,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ,Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Новый ТаблицаЗначений);
	Таблица = ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	ТаблицаДанных.Загрузить(Таблица);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьШтрихкод(Команда)
	
	СформироватьШтрихкоды();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьШтрихкоды()
	
	МаксимальныйШтрихкод = Неопределено;
	
	Для каждого ТекСтр Из ТаблицаДанных Цикл
		
		Если ПустаяСтрока(ТекСтр.Штрихкод) Тогда
			
			Запись = РегистрыСведений.ШтрихКоды.СоздатьМенеджерЗаписи();
			Запись.Объект = ТекСтр.ОсновноеСредство;
			Запись.ИнвентарныйНомер = ТекСтр.ИнвентарныйНомер;
			Запись.ТипШтрихкода = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13;
			Запись.Штрихкод = РегистрыСведений.ШтрихКоды.СформироватьШтрихКодEAN13(МаксимальныйШтрихКод);
			Запись.Записать(Истина);
			
			ТекСтр.Штрихкод = Запись.Штрихкод;
			МаксимальныйШтрихкод = Запись.Штрихкод;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ШтрихкодИзКлючаЗаписи(ВыбранноеЗначение)
	
	ЗаписьРегистра = РегистрыСведений.Штрихкоды.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(ЗаписьРегистра, ВыбранноеЗначение);
	ЗаписьРегистра.Прочитать();
	
	Возврат ЗаписьРегистра.Штрихкод;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаПолученияДанныхШтрихкода(Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Текст = "" Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеВыбора = ПолучитьДанныеВыбораШтрихкода(Текст);
	СтандартнаяОбработка = (ДанныеВыбора.Количество() = 0);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьДанныеВыбораШтрихкода(Текст = "")
	
	ТекущиеДанные = Элементы.ТаблицаДанных.ТекущиеДанные;
	
	ПараметрыДанных = Новый Структура;
	ПараметрыДанных.Вставить("Объект"			, ТекущиеДанные.ОсновноеСредство);
	ПараметрыДанных.Вставить("ИнвентарныйНомер"	, ТекущиеДанные.ИнвентарныйНомер);
	ПараметрыДанных.Вставить("Штрихкод"			, Текст);
	
	Возврат ПолучитьДанныеВыбораШтрихкодаСервер(ПараметрыДанных);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеВыбораШтрихкодаСервер(Знач ПараметрыДанных)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(Штрихкоды.ТипШтрихкода) КАК ТипШтрихкода,
	|	Штрихкоды.Штрихкод
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Объект = &Объект
	|	И Штрихкоды.ИнвентарныйНомер = &ИнвентарныйНомер";
	Если ЗначениеЗаполнено(ПараметрыДанных.Штрихкод) Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И Штрихкоды.Штрихкод ПОДОБНО &Штрихкод";
		Запрос.УстановитьПараметр("Штрихкод", ПараметрыДанных.Штрихкод + "%");
	КонецЕсли;
	Запрос.УстановитьПараметр("Объект", ПараметрыДанных.Объект);
	Запрос.УстановитьПараметр("ИнвентарныйНомер", ПараметрыДанных.ИнвентарныйНомер);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Список = Новый СписокЗначений;
	Шаблон = "%1 (%2)";
	
	Пока Выборка.Следующий() Цикл	
		Список.Добавить(Выборка.Штрихкод, СтрШаблон(Шаблон, Выборка.Штрихкод, Выборка.ТипШтрихкода));
	КонецЦикла;
	
	Возврат Список;
	
КонецФункции

#КонецОбласти
